package com.java.algorithm.hot100;

public class 不同的二叉搜索树 {
    public static void main(String[] args) {
        /**
         * 给你一个整数 n ，求恰由n个节点组成且节点值从1到n互不相同的二叉搜索树有多少种？
         * 返回满足题意的二叉搜索树的种数。
         * 输入：n = 3    输出：5
         */

         /**思路：
          * 一般有多少可能性的问题， 
          * 或者有多少路线的问题
          * 可以考虑动规解决
          */

        /**
         * 1.确认dp数组以及下标的含义
         * 
         * 2.确定递推公式
         * 
         * 3.dp数组如何初始化
         * 
         * 4.确定遍历顺序
         * 
         * 5.验证
         * 
         */
        

          
        










    }

    
}
